import React from 'react'
import { WOW } from 'wowjs';
import 'wowjs/css/libs/animate.css'
import './TenYears.css'
import { useEffect, useRef } from 'react';

export default function TenYears() {

    useEffect(() => {
        const wow = new WOW();
        wow.init();
    }, []);

    return (
        <>
            <div className="tenY-P">
                <div className="tenY-imgholder">
                   <img src="./img/home_pizza_about_bg.jpg" alt="" /> 
                </div>
                
                <div id="text-over" className='wow fadeInLeft' data-wow-duration='1.7s' data-wow-delay='0.5s'>
                    <h2>با سال ها تجربه ، بهترین شدیم ...</h2>
                    <p id='pOne'>با سال ها تجربه، رستوران ما به یکی از بهترین‌های شهر تبدیل شده است. محتوای منوی غنی و با کیفیت، محیط دلپذیر و فضای پذیرایی عالی، همه با هم به دلیل اعتماد و رضایت مشتریان، این رستوران را به قلب شهر سوق داده‌اند</p>
                    <p id='pTwo'>با خوردن غذاهایی که در اینجا سرو میشود، لذت عالی غذاخوردن را به طور کامل تجربه خواهید کرد. همین حالا برای رزرو میز با ما تماس بگیرید و از همه لحاظ بهترین رستوران شهر را تجربه کنید. با گذشت سال ها از فعالیت در صنعت رستوران داری، شاهد تحولات متعدد در این صنعت بوده‌ایم و از تجربه خود استفاده کرده و با تلاش و کوشش بی وقفه، رستوران ما توانسته است به یکی از بهترین رستوران‌های منطقه تبدیل شود. منوی متنوع و با کیفیت، فضایی شیک و مطمئن برای مشتریان، خدماتی با کیفیت و کارافرینی و نوآوری مستمر، این امکان را برای ما فراهم کرده تا تبدیل به یکی از گزینه‌های اول مشتریان در قلب شهر شویم</p>
                    <p id='pThree'>گذشت سال ها از فعالیت در صنعت رستوران داری، شاهد تحولات متعدد در این صنعت بوده‌ایم و از تجربه خود استفاده کرده و با تلاش و کوشش بی وقفه، رستوران ما توانسته است به یکی از بهترین رستوران‌های منطقه تبدیل شود. منوی متنوع و با کیفیت، فضایی شیک و مطمئن برای مشتریان، خدماتی با کیفیت و کارافرینی و نوآوری مستمر، این امکان را برای ما فراهم کرده تا تبدیل به یکی از گزینه‌های اول مشتریان در قلب شهر شویم.</p>
                    
                </div>

            </div>
        </>
    )
}

